# Pandas

Panadas is a Python Module for numerical analysis and Time series analaysis

## Basic Data Structures

In [16]:
import math
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

#example dataframe from the bokeh module
from bokeh.sampledata.autompg import autompg as df
from scipy.stats import linregress

### Series
**Series** can only contain **single** list with index, whereas dataframe can be made of more than one series or we can say that a **dataframe is a collection of series** that can be used to analyse the data.

In [2]:
my_series = pd.Series([
4.6, 2.1, -4.0, 3.0])

print(my_series)

0    4.6
1    2.1
2   -4.0
3    3.0
dtype: float64

Can also just print the values

In [3]:
print(my_series.values)

[ 4.6  2.1 -4.   3. ]

### DataFrame

Creating an empty dataframe

In [4]:
df1 = pd.DataFrame()

You can also create a empty DataFrame with define columns

In [5]:
df1 = pd.DataFrame(columns=('Col 1', 'Col 2', 'Col3'))

In [6]:
a = pd.DataFrame([[1,2,3],[3,4,5]], columns=list('ABC'))
b = pd.DataFrame([[5,2,3],[7,4,5]], columns=list('BDE'))
c = pd.DataFrame([[11,12,13],[17,14,15]], columns=list('XYZ'))

## Writing To and Reading From Files

CSV

Let's write of auto mpg data frame to csv.  Note: If you leave the index parameter set to True, you'll get an extra column called 'Unnamed:0' in your CSV

In [7]:
df.to_csv("autompg.csv", index=False)

Here is how we read a CSV

In [9]:
df1 = pd.read_csv("autompg.csv")
df1.head()

    mpg  cyl  displ   hp  weight  accel  yr  origin                       name
0  18.0    8  307.0  130    3504   12.0  70       1  chevrolet chevelle malibu
1  15.0    8  350.0  165    3693   11.5  70       1          buick skylark 320
2  18.0    8  318.0  150    3436   11.0  70       1         plymouth satellite
3  16.0    8  304.0  150    3433   12.0  70       1              amc rebel sst
4  17.0    8  302.0  140    3449   10.5  70       1                ford torino

   You can also specify which columns you'd like to read in...if you want a subset of the set

In [10]:
df2 = pd.read_csv("autompg.csv", usecols=['name', 'mpg'])
df2.head()

    mpg                       name
0  18.0  chevrolet chevelle malibu
1  15.0          buick skylark 320
2  18.0         plymouth satellite
3  16.0              amc rebel sst
4  17.0                ford torino

You can also use different delimters

In [11]:
df1.to_csv("autompg.tsv", index=False, sep="\t")
df1 = pd.read_csv("autompg.tsv", sep="\t")
df1.head()

    mpg  cyl  displ   hp  weight  accel  yr  origin                       name
0  18.0    8  307.0  130    3504   12.0  70       1  chevrolet chevelle malibu
1  15.0    8  350.0  165    3693   11.5  70       1          buick skylark 320
2  18.0    8  318.0  150    3436   11.0  70       1         plymouth satellite
3  16.0    8  304.0  150    3433   12.0  70       1              amc rebel sst
4  17.0    8  302.0  140    3449   10.5  70       1                ford torino

### Handling Large Data Files

You will often be working with files that are 1GB+ and reading them all in one step is difficult.  Chunking is an approach that might solve that problem.

In [ ]:
large_df = pd.DataFrame()

for i in range(100):
    large_df = large_df.append(df1, ignore_index=True)

large_df.to_csv("large.csv", index=False)

for chunk in pd.read_csv('large.csv', chunksize=1000):
    print(chunk.head(1))

## Working with Excel

Use ExcelWriter to write a DataFrame or multiple DataFrames to an Excel Workbook

In [ ]:
df2 = pd.DataFrame([{'Name':'Steve Jobs', 'Company':'Apple'}, {'Name':'Bill Gates', 'Company':'Microsoft'}])

# Initialize the workbook
writer = pd.ExcelWriter('test_workbook.xlsx')

#Write DataFrames to Excel sheets
df1.to_excel(writer, "Sheet1")
df2.to_excel(writer, "Sheet2")
writer.save()

When reading from an Excel workbook, Pandas assumes you want just the first sheet of the workbook by default

In [ ]:
df1 = pd.read_excel('test_workbook.xlsx')
df1.head()

To read a specific sheet you simply use the input variable sheet_name

In [ ]:
df1 = pd.read_excel('test_workbook.xlsx', sheet_name='Sheet2')
df1.head()

## Working with JSON/APIs

This is a very simple example to illustrate that its easy to work with JSON payloads as long as the payload has a structure that can be interpreted.

Pandas can write a DataFrame to a JSON file, and also read in from a JSON file...

In [ ]:
df.to_json("json_file.json")

from_json = pd.read_json("json_file.json")

from_json.head()

This can also be done for JSON objects

In [ ]:
json_object = df.to_json() # don't specify a file and it create a JSON object instead

from_json = pd.read_json(json_object)

from_json.head()

## Summarizing and Inspecting a  DataFrame

Below are a sample of the most popular and useful methods built into pandas in order to explore your data at a cursory level

In [ ]:
df.shape

In [ ]:
df.index

In [ ]:
df.info()

In [ ]:
df.count()

In [ ]:
df.describe() # Will process numeric columns for count, mean, standard deviation (std), min, 25%, 50%, 75%, max

In [ ]:
df.head() # first 5 rows of the DataFrame

In [ ]:
df.head(10) # first 10 rows

In [ ]:
df.tail() # last 5 rows

In [ ]:
df.tail(10) # last 10 rows

### Verifying Data Types

Its important to know how pandas will treat the data stored within a DataFrame and how it will read specific columns.  For example, pandas will try to automatically parse numbers as int or float and can parse dates as datetime objects.

Note: pandas will automatically use numpy objects

In [ ]:
# View column names and their associated data types
df.dtypes

In [ ]:
# Select columns where the data type is int64 using numpy
df.select_dtypes([np.int64])

In [ ]:
# Select columns where the data type is a numpy object (like a string)
df.select_dtypes([np.object])

In [ ]:
# You can change the data type of a column
df2 = df.copy()
df2['mpg'] = df2['mpg'].astype(str)
df2['mpg'].unique()

Modifying DataFrames

Modifications only work on assignment or when using inplace=True, this instructs the DataFrame to make the change without reassignment

In [ ]:
# Change by assignment
df2 = df.drop('cyl', axis=1)
df2.head()

In [ ]:
# Change in place
df2.drop('hp', axis=1, inplace=True)
df2.head()

## Working with Columns

In [ ]:
# List Column names
df.columns

In [ ]:
# Store Column names as a list - generally easier to work with
x = list(df.columns)
print(x)

You can batch rename columns but it requires a dictionary of the old values mapped to the new ones

In [ ]:
df2 = df.rename(columns={'mpg':'miles_per_gallon', 'cyl':'cylinders'})
df2.head()

You are able to create new columns quite easily.  Similar to a dicitonary, if a columnn doesn't exist, pandas will automatically create one

In [ ]:
df2 = df.copy()
df2['year'] = '2020' #This will set every rows year value to 2020
df2.head()

### Accessing Index and Columns

In [ ]:
# By Column

df['name'].head()

In [ ]:
# Alternatively - Note: This doesn't work if there are spaces in the column name!
df.name.head()

In [ ]:
# By index - this returns rows 2-4 non inclusive
df.iloc[2:4]

In [ ]:
# By index and column
df.loc[[1], ['name']]

In [ ]:
# By Column and Row - HP of a Plymouth Satellite
df.iloc[2,3]

### Removing Duplicates

This is used frequently to reduce the size of a DataFrame.  Let's use the existing df and add some duplicates to it...

In [ ]:
len(df)

In [ ]:
df2 = df.append(df, ignore_index=True)
print("There are {} rows in the DataFrame".format(len(df2)))

In [ ]:
#remove any duplicate rows
df2.drop_duplicates(inplace=True)
print("There are {} rows in the DataFrame".format(len(df2)))

In [ ]:
# specify columns to reduce the number of cells in a row that must match to be dropped
df2 = df2.drop_duplicates(subset=['mpg'])
print("There are {} rows in the DataFrame".format(len(df2)))

### Filtering on Column Data

Pandas allows you to filter on specfic columnar values

In [ ]:
# Create a new DataFrame where 'cyl' value == 8

df2 = df.loc[df['cyl'] == 8]
df2.head()

In [ ]:
# Reset the index so that the index is ordered again
df2 = df.loc[df['cyl'] == 8].reset_index(drop=True)
df2.head()

In [ ]:
# This can also be done without .loc
df2 = df[df['mpg'] >= 16].reset_index(drop=True)
df2.head()

### Fill or Drop NaN or null values

Often you will get poor data/missing data from real life data sets - pandas has some built in functionality to handle this common scenario

In [ ]:
df.reindex()

In [ ]:
# First we'll add some empty calues to the data frame
df3 = pd.DataFrame([{'name':'Ford Taurus'}, {'mpg':18.0}])
df2 = df.append(df3, ignore_index=True)

In [ ]:
#Check for NaN values

df2.loc[df2['name'].isnull()]

In [ ]:
# True or False on columns contain null values

df2.isnull().any()

In [ ]:
# Sum of all missing values by column

df2.isnull().sum()

In [ ]:
# Sum of all missing values across all columns

df2.isnull().sum().sum()

In [ ]:
# Locate all missing values

df2.loc[df2.isnull().T.any()]

In [ ]:
# Fill NaN values

df2.fillna(0).tail()

In [ ]:
# Drop NaN values

df2.dropna().tail()

In [ ]:
# You can also target a column

df2['cyl'].fillna(0).tail()

In [ ]:
# Drop a row only if all columns are NaN

df2.dropna(how='all').tail()

In [ ]:
# Drop if specific columns are NaN

df2.dropna(subset=['displ','hp']).tail()

### Simple Operations on DataFrames

In [ ]:
# All Unique values in column

df['mpg'].unique()

In [ ]:
# Count of unique values in column

df['cyl'].value_counts()

In [ ]:
# Count all the entries in a column

df['hp'].count()

In [ ]:
# Sum all the entries in a column

df['hp'].sum()

In [ ]:
# Mean of all the values in a column

df['cyl'].mean()

In [ ]:
# Median of all the values in a column

df['cyl'].median()

In [ ]:
# Minimum of all column values

df['cyl'].min()

In [ ]:
# Maximum of all column

df['cyl'].max()

In [ ]:
# Standard Deviation

df['cyl'].std()

# Pandas (Advanced)

This is a contuniation of the LO3 - Panda's material.  It is likley out of the scope of the Programming for Data Science course and can be seen as optional.  It contains advanced usage of pandas.

## Sorting Columns

In [17]:
df.sort_values('mpg', ascending=False).head()

      mpg  cyl  displ  hp  weight  accel  yr  origin                  name
320  46.6    4   86.0  65    2110   17.9  80       3             mazda glc
327  44.6    4   91.0  67    1850   13.8  80       3   honda civic 1500 gl
323  44.3    4   90.0  48    2085   21.7  80       2  vw rabbit c (diesel)
388  44.0    4   97.0  52    2130   24.6  82       2             vw pickup
324  43.4    4   90.0  48    2335   23.7  80       2    vw dasher (diesel)

In [18]:
# Multi-column sort

df.sort_values(['mpg', 'displ']).head()

      mpg  cyl  displ   hp  weight  accel  yr  origin              name
28    9.0    8  304.0  193    4732   18.5  70       1          hi 1200d
26   10.0    8  307.0  200    4376   15.0  70       1         chevy c20
25   10.0    8  360.0  215    4615   14.0  70       1         ford f250
27   11.0    8  318.0  210    4382   13.5  70       1        dodge d200
123  11.0    8  350.0  180    3664   11.0  73       1  oldsmobile omega

## Merging DataFrames

While many of htese are similar, there is numerous arguments that can be used in conjunction to truly customize the type of DataFrame merging/joining/appending/concatinating you are trying to achieve.

We will define some sample data frames to use as examples of the various operations...

In [21]:
a = pd.DataFrame([[1,2,3],[3,4,5]], columns=list('ABC'))
b = pd.DataFrame([[5,2,3],[7,4,5]], columns=list('BDE'))
c = pd.DataFrame([[11,12,13], [17,14,15]], columns=list('XYZ'))

In [ ]:
print(a)

In [ ]:
print(b)

In [ ]:
print(c)

### Appending DataFrames

In [22]:
ab = a.append(b)
print(ab)

AttributeError: 'DataFrame' object has no attribute 'append'

### Concatenating DataFrames

In [23]:
abc = pd.concat([a,b,c], sort=False)
print(abc)

     A    B    C    D    E     X     Y     Z
0  1.0  2.0  3.0  NaN  NaN   NaN   NaN   NaN
1  3.0  4.0  5.0  NaN  NaN   NaN   NaN   NaN
0  NaN  5.0  NaN  2.0  3.0   NaN   NaN   NaN
1  NaN  7.0  NaN  4.0  5.0   NaN   NaN   NaN
0  NaN  NaN  NaN  NaN  NaN  11.0  12.0  13.0
1  NaN  NaN  NaN  NaN  NaN  17.0  14.0  15.0

### Joining DataFrames

Joins are similar to the concept in SQL, can specify join on index

In [24]:
joined_df = a.join(b, how='left', lsuffix='_a', rsuffix='_b')
print(joined_df)

   A  B_a  C  B_b  D  E
0  1    2  3    5  2  3
1  3    4  5    7  4  5

### Merging DataFrames

This allows you to merge two or more DataFrames with overlapping columns - similar to join

In [25]:
merged_df = a.merge(b, left_on='B', right_on='D')
print(merged_df)

   A  B_x  C  B_y  D  E
0  1    2  3    5  2  3
1  3    4  5    7  4  5

### Iterating DataFrames

Iterating is typically only viable on a small DataFrame.  For larger DataFrames you will generally need to use apply/map and functions for efficiency

Accessing values is done by index
    row[0] = Index
    row[1] = Values as pandas series
    row[1][0] = First column value of row, can specify column rows[1]['Column']

In [26]:
counter = 0
for row in df.iterrows():
    counter += 1
    if counter > 20:
        break
    print(row[1].keys()[0])
    print(row[0], row[1][0])

mpg
0 18.0
mpg
1 15.0
mpg
2 18.0
mpg
3 16.0
mpg
4 17.0
mpg
5 15.0
mpg
6 14.0
mpg
7 14.0
mpg
8 14.0
mpg
9 15.0
mpg
10 15.0
mpg
11 14.0
mpg
12 15.0
mpg
13 14.0
mpg
14 24.0
mpg
15 22.0
mpg
16 18.0
mpg
17 21.0
mpg
18 27.0
mpg
19 26.0

### IterTuples
A faster and more efficent way to iterate a DataFrame

In [27]:
counter = 0
for rowtuples in df.itertuples():
    counter += 1
    if counter > 20:
        break
    print(rowtuples[1], rowtuples[2])

18.0 8
15.0 8
18.0 8
16.0 8
17.0 8
15.0 8
14.0 8
14.0 8
14.0 8
15.0 8
15.0 8
14.0 8
15.0 8
14.0 8
24.0 4
22.0 6
18.0 6
21.0 6
27.0 4
26.0 4

### Pivoting on a DataFrame

You can create Excel style pivot tables based on specified criteria

In [28]:
from bokeh.sampledata.autompg import autompg as df
# Basic Pivot
#print(df)
df.pivot_table(index=['mpg', 'name']).head(20)

                                       accel  cyl  displ     hp  origin  \
mpg  name
9.0  hi 1200d                           18.5    8  304.0  193.0       1
10.0 chevy c20                          15.0    8  307.0  200.0       1
     ford f250                          14.0    8  360.0  215.0       1
11.0 chevrolet impala                   14.0    8  400.0  150.0       1
     dodge d200                         13.5    8  318.0  210.0       1
     mercury marquis                    11.0    8  429.0  208.0       1
     oldsmobile omega                   11.0    8  350.0  180.0       1
12.0 buick electra 225 custom           11.0    8  455.0  225.0       1
     dodge monaco (sw)                  11.5    8  383.0  180.0       1
     ford country                       12.5    8  400.0  167.0       1
     mercury marquis brougham           11.5    8  429.0  198.0       1
     oldsmobile delta 88 royale         13.5    8  350.0  160.0       1
     oldsmobile vista cruiser           12.5    8  350.0  180.0       1
13.0 amc ambassador brougham            11.0    8  360.0  175.0       1
     buick century 350                  13.0    8  350.0  175.0       1
     buick century luxus (sw)           14.5    8  350.0  150.0       1
     buick lesabre custom               13.5    8  350.0  155.0       1
     chevrolet caprice classic          12.0    8  400.0  150.0       1
     chevrolet chevelle concours (sw)   14.0    8  307.0  130.0       1
     chevrolet impala                   12.0    8  350.0  165.0       1

                                       weight    yr
mpg  name
9.0  hi 1200d                          4732.0  70.0
10.0 chevy c20                         4376.0  70.0
     ford f250                         4615.0  70.0
11.0 chevrolet impala                  4997.0  73.0
     dodge d200                        4382.0  70.0
     mercury marquis                   4633.0  72.0
     oldsmobile omega                  3664.0  73.0
12.0 buick electra 225 custom          4951.0  73.0
     dodge monaco (sw)                 4955.0  71.0
     ford country                      4906.0  73.0
     mercury marquis brougham          4952.0  73.0
     oldsmobile delta 88 royale        4456.0  72.0
     oldsmobile vista cruiser          4499.0  73.0
13.0 amc ambassador brougham           3821.0  73.0
     buick century 350                 4100.0  73.0
     buick century luxus (sw)          4699.0  74.0
     buick lesabre custom              4502.0  72.0
     chevrolet caprice classic         4464.0  73.0
     chevrolet chevelle concours (sw)  4098.0  72.0
     chevrolet impala                  4274.0  72.0

In [29]:
# Can get very complex...

df.pivot_table(values=['weight'], index=['cyl', 'name'], aggfunc=np.mean).head(20)

                               weight
cyl name
3   maxda rx3                  2124.0
    mazda rx-4                 2720.0
    mazda rx-7 gs              2420.0
    mazda rx2 coupe            2330.0
4   amc concord                3003.0
    amc spirit dl              2670.0
    audi 100 ls                2430.0
    audi 100ls                 2638.0
    audi 4000                  2188.0
    audi fox                   2219.0
    bmw 2002                   2234.0
    bmw 320i                   2600.0
    buick opel isuzu deluxe    2155.0
    buick skylark              2635.0
    buick skylark limited      2670.0
    capri ii                   2572.0
    chevrolet camaro           2950.0
    chevrolet cavalier         2605.0
    chevrolet cavalier 2-door  2395.0
    chevrolet cavalier wagon   2640.0

### Boolean Indexing

Filter DataFrame on Multiple Columns and Values using Boolean index

In [30]:
df.loc[(df['cyl'] < 6) &
       (df['mpg'] > 35)].head(20)

,mpg,cyl,displ,hp,weight,accel,yr,origin,name
216,36.0,4,79.0,58,1825,18.6,77,2,renault 5 gtl
242,43.1,4,90.0,48,1985,21.5,78,2,volkswagen rabbit custom diesel
243,36.1,4,98.0,66,1800,14.4,78,1,ford fiesta
245,39.4,4,85.0,70,2070,18.6,78,3,datsun b210 gx
246,36.1,4,91.0,60,1800,16.4,78,3,honda civic cvcc
293,35.7,4,98.0,80,1915,14.4,79,1,dodge colt hatchback custom
302,37.3,4,91.0,69,2130,14.7,79,2,fiat strada custom
307,41.5,4,98.0,76,2144,14.7,80,2,vw rabbit
308,38.1,4,89.0,60,1968,18.8,80,3,toyota corolla tercel
310,37.2,4,86.0,65,2019,16.4,80,3,datsun 310
318,37.0,4,119.0,92,2434,15.0,80,3,datsun 510 hatchback
320,46.6,4,86.0,65,2110,17.9,80,3,mazda glc
322,40.8,4,85.0,65,2110,19.2,80,3,datsun 210
323,44.3,4,90.0,48,2085,21.7,80,2,vw rabbit c (diesel)
324,43.4,4,90.0,48,2335,23.7,80,2,vw dasher (diesel)
325,36.4,5,121.0,67,2950,19.9,80,2,audi 5000s (diesel)
327,44.6,4,91.0,67,1850,13.8,80,3,honda civic 1500 gl
339,39.1,4,79.0,58,1755,16.9,81,3,toyota starlet
340,39.0,4,86.0,64,1875,16.4,81,1,plymouth champ
341,35.1,4,81.0,60,1760,16.1,81,3,honda civic 1300

### Crosstab Viewing

Contingency table (also know as a cross tabulation or crosstab) is a type of table in a matrix format that displays the (multivariate) fequency distrobution of the variables

In [ ]:
pd.crosstab(df['cyl'], df['yr'], margins=True)

### An example of how complex things can get...

In [ ]:
#Top number of Column1 unique values based on the mean of NumColumn Unique Values using .nlargest

df.cyl.value_counts().nlargest(math.ceil(df.mpg.value_counts().mean())).head()

### Creating a new column using logic

In [ ]:
df2 = df.copy()
df2['mpg_str'] = df2['name'] + ' has MPG ' + df2['mpg'].astype(str)
df2.head()

### Functions on DataFrames

The fastest and most effecient method of running calculations against an entire DataFrame - should be used most of the time when 'iterating' or doing analytics

axis = 0 means function will be applited to each column
axis = 1 means funciton will be applied to each row

#### Map

Map applys a function to each element in a series - sounds like iterating, yes?

In [ ]:
def concon(x):
    return 'Adding this string to all values: ' +  str(x)

df['name'].map(concon).head()

### Apply

Apply runs a function against the axis specified

In [ ]:
df2['hp_and_mpg'] = df2[['hp', 'mpg']].apply(sum, axis=1)
df2.loc[:, ['hp', 'mpg', 'hp_and_mpg', 'name']].head()

### ApplyMap

This runs a function against each element in a DataFrame (think of 'cells' in a spreadsheet)

In [ ]:
df.applymap(concon).head()

### In Class Exercise

Use apply to find the number of missing values in each column and each row. Save screenshot of code and output as pandasapply.jpeg

In [ ]:
# Remove this before distrubuting to students...

def missing(x):
    return sum(x.isnull())

#columns
df.apply(missing, axis=0)

In [ ]:
#rows
df.apply(missing, axis=1)

### Conditionally Updating Values

You can use .loc to update values where a condition has been met.  Think "Set X WHERE" in SQL

In [ ]:
df2 = df.copy()
df2['efficiency'] = ""

df2.loc[(df2.mpg < 10), 'efficiency'] = 'poor'
df2.loc[(df2.mpg >= 10) & (df2.mpg < 30), 'efficiency'] = 'intermediate'
df2.loc[(df2.mpg >= 30), 'efficiency'] = 'high'

df2.tail()

### GroupBy and Aggregate

Pandas makes it pretty simple to group values and aggregate other results

In [ ]:
# Setting as_index to Flase will keep the grouped values as regular column values rather than indicies
grouped_df = df.groupby(by=['cyl'])

# Now we can use .agg to aggregate the values and run specified funtions - note: we can not create new columns here
aggregated = grouped_df.agg({
    'mpg': np.mean,
    'displ': np.mean,
    'hp' : np.mean,
    'yr' : np.max,
    'accel' :'mean'
})

aggregated.head()

In Class Exercise: Combine ser1 and ser2 to form a dataframe.  Save your code and output as a screenshot named pandasseries1.jpeg

In [ ]:
ser1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
ser2 = pd.Series(np.arange(26))

# Solution 1
df = pd.concat([ser1, ser2], axis=1)

# Solution 2
df = pd.DataFrame({'col1': ser1, 'col2': ser2})
print(df.head())

In Class Exercise: Create a pandas series from each of the items below: a list, numpy and a dictionary.  Save your code and output as a screenshot called pandasseries2.jpeg

In [ ]:
# Inputs
import numpy as np
mylist = list('abcedfghijklmnopqrstuvwxyz')
myarr = np.arange(26)
mydict = dict(zip(mylist, myarr))

# Solution
ser1 = pd.Series(mylist)
ser2 = pd.Series(myarr)
ser3 = pd.Series(mydict)
print(ser3.head())